dev/Server/test/load/sli_3/config.yml
config:
  target: "https://localhost:3333/command"
  phases:
    - duration: 100
      arrivalRate: 10
      name: thousand_users_phase
  payload:
    path: "users.csv"
    fields:
      - "username"
      - "password"
      - "age"
      - "storeName"
      - "productName"
    order: sequence
    skipHeader: false

scenarios:
  - name: "1000 users"
    flow:
      - get:
          url: "/enter"
          capture:
            json: "$.userId"
            as: userId
      - think: 2
      - post:
          url: "/register"
          json:
            username: "{{ username }}"
            password: "{{ password }}"
            age: "{{ age }}"
      - think: 2
      - post:
          url: "/login"
          json:
            userId: "{{ userId }}"
            username: "{{ username }}"
            password: "{{ password }}"
          capture:
            json: "$.userId"
            as: userId
      - think: 2
      - post:
          url: "/openStore"
          json:
            userId: "{{ userId }}"
            storeName: "{{ storeName }}"
            bankAccountNumber: 1111
            storeAddress: "disneyland"